Ruby/Rails/app/controllers/charts_controller.rb

	def index
		@charts = Chart.all
---
SELECT "charts".* FROM "charts"

	def show
		@chart = Chart.find(params[:id])
---
SELECT  "charts".* FROM "charts"  WHERE "charts"."id" = ? LIMIT 1  [["id", 1]]

	def edit
		@chart = Chart.find(params[:id])
---
SELECT  "charts".* FROM "charts"  WHERE "charts"."id" = ? LIMIT 1  [["id", 1]]

	def create
		@chart = Chart.new(chart_params)

		if @chart.save
---
INSERT INTO "charts" ("created_at", "json", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-05-29 22:42:06.103191"], ["json", ""], ["name", "My first chart"], ["updated_at", "2015-05-29 22:42:06.103191"]]

	def update
		@chart = Chart.find(params[:id])

		if @chart.update(chart_params)
---
SELECT  "charts".* FROM "charts"  WHERE "charts"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "charts" SET "name" = ?, "updated_at" = ? WHERE "charts"."id" = 4  [["name", "My 1st Chart"], ["updated_at", "2015-06-01 16:16:36.648968"]]

	def destroy
		@chart = Chart.find(params[:id])
		@chart.destroy
---
SELECT  "charts".* FROM "charts"  WHERE "charts"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "charts" WHERE "charts"."id" = ?  [["id", 1]]